[
    {
        "id": 1,
        "title": "Blah blah",
        "content": "Here are the biggest enterprise technology acquisitions of 2021 so far, in reverse chronological order.",
        "img": "/netpractice.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": []
    },
    {
        "id": 2,
        "title": "Philosophers",
        "content": "Here are the biggest enterprise technology acquisitions of 2021 so far, in reverse chronological order.",
        "img": "/netpractice.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": []
    },
    {
        "id": 3,
        "title": "NetPractice",
        "content": "NetPractice is a comprehensive project consisting of 42 modules designed to provide a deep understanding of networking fundamentals. NetPractice involves delving into essential concepts such as IPv4 addressing, subnetting, and the pivotal roles of routers, switches, and other network devices.",
        "img": "/netpractice.jpg",
        "sourceCodeLink": "#",
        "tags": ["Network & system administration"]
    },
    {
        "id": 4,
        "title": "Inception",
        "content": "Inception was an introduction to containerization, focusing on virtualizing Docker images for services such as Nginx, MariaDB, and WordPress. This project allowed us to explore the basics of Docker and its capabilities for creating isolated environments to run applications efficiently. Through this experience, we gained practical knowledge of containerization and its relevance in modern software development and deployment",
        "img": "/inception1.jpg",
        "sourceCodeLink": "https://github.com/ossamakhiar/inception",
        "tags": ["Docker", "SysAdmin", "Containerization"]
    },
    {
        "id": 5,
        "title": "Cub3d",
        "content": "Cub3d is a 3D game inspired by Wolfenstein 3D and developed using the C programming language. This project served as a profound exploration of computer graphics, particularly delving deep into the concepts of ray casting. Ray casting involves simulating a 3D environment by casting rays from the player's viewpoint and rendering the scene based on intersections with walls and other objects. Through this project, we gained hands-on experience in implementing graphics algorithms, understanding perspective rendering, and honing our skills in game development",
        "img": "/cub3d.png",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["3D", "Game dev", "C programming language"]
    },
    {
        "id": 6,
        "title": "Minishell",
        "content": "This project was a collaborative effort between two of us, working together to build a basic shell from scratch in the C language. As beginners in programming, we've encountered a significant learning curve, delving into processes, signal handling, file descriptors, and the core workings of shells.",
        "img": "/minishell.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["Bash", "C programming language"]
    },
    { 
        "id": 7, 
        "title": "Philosophers",
        "content": "In this project, you will solve the dining philosophers problem, you will delve into the fundamentals of concurrent programming, exploring threading and multiprocessing techniques. Through the simulation of the dining philosophers problem, you'll gain insights into creating threads and employing synchronization primitives such as mutexes and semaphores. By implementing a solution that ensures no philosopher starves (deadlock), you'll tackle challenges in both multithreading and multiprocessing environments, honing your skills in concurrent programming and synchronization mechanisms",
        "img": "/philosophers.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["Unix", "Concurrent programming", "C programming language"]
    },
    {
        "id": 8,
        "title": "WebServ",
        "content": "Webserv was a collaborative project where we implemented HTTP/1.1 Web Server adhering to RFC standards. We began by setting up the core logic of the web server. Our approach involved using Non-blocking IO to efficiently manage concurrent connections. This allowed us to handle incoming requests promptly and generate appropriate responses. Additionally, we integrated CGI (Common Gateway Interface) to enable dynamic content generation on the server side. This project provided a comprehensive exploration of web server architecture and HTTP protocol implementation.",
        "img": "/webserv.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["Unix", "Network", "C++"]
    },
    {
        "id": 9,
        "title": "Trenscendance",
        "content": "first web project. The objective: create an online multiplayer Pong with chat features (friends, channels) and matchmaking...",
        "img": "/trenscendance1.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["TypeScript", "NestJS", "React.JS", "WebSockets"]
    },
    {
        "id": 10,
        "title": "Piscine object",
        "content": "This project delves into C++ object-oriented design, exploring design patterns and adhering to clean code principles through practical exercises. Topics covered include PNG writer implementation, UML modeling, graph theory, and more.",
        "img": "/piscine_object.jpg",
        "sourceCodeLink": "http://www.github.com/ossamakhiar/",
        "tags": ["Object-oriented design", "Design patterns & principles"]
    }
]

